#pragma once

#define ITEM_SERVER_MAX				1500
#define INVENTORYSERVER_MAX			100
#define	MAX_ITEMSINITEMBOX			50

#define MAX_AGING				24

enum EWeaponClass
{
	WEAPONCLASS_None,
	WEAPONCLASS_Melee,
	WEAPONCLASS_Ranged,
	WEAPONCLASS_Magic,
};

static int iaAgingChance[MAX_AGING] =
{
	0,0,0,0,0,0,0,0,4,8,12,16,18,20,24,28,32,36,40,44,48,52,56,60
};

static DWORD iaSheltomAgingList[MAX_AGING][12]
{
	{3, 3, 4, 4, 5, 0, 0, 0, 0, 0, 0, 0},					// 1
	{3, 3, 4, 4, 5, 5, 0, 0, 0, 0, 0, 0},					// 2
	{3, 3, 4, 4, 5, 5, 6, 0, 0, 0, 0, 0},					// 3
	{3, 3, 4, 4, 5, 5, 6, 6, 0, 0, 0, 0},					// 4
	{3, 3, 4, 4, 5, 5, 6, 6, 7, 0, 0, 0},					// 5
	{3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 0, 0},					// 6
	{3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 0},					// 7
	{3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8},					// 8
	{4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 0},					// 9
	{4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9},					// 10
	{5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 0},					// 11
	{5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10},					// 12
	{6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 0},				// 13
	{6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11},				// 14
	{7, 7, 8, 8, 9, 9, 10, 10, 11, 11, 12, 0},				// 15
	{7, 7, 8, 8, 9, 9, 10, 10, 11, 11, 12, 12},				// 16
	{8, 8, 9, 9, 10, 10, 11, 11, 12, 12, 13, 0},			// 17
	{8, 8, 9, 9, 10, 10, 11, 11, 12, 12, 13, 13},			// 18
	{9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 0},			// 19
	{9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14},			// 20
	{10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 0},		// 21

	MIXEFFECT_PotionCount		= 0x00100000,
};

enum EItemInvSound
{
	ITEMINVSOUND_None			= 0,
	ITEMINVSOUND_Axe			= 1,
	ITEMINVSOUND_Claw			= 2,
	ITEMINVSOUND_Armor			= 9,
};

enum EItemSlot : int
{
	ITEMSLOT_None				= 0,

	ITEMSLOT_RightHand			= 1,
	ITEMSLOT_LeftHand			= 2,
	ITEMSLOT_Armor				= 3,
	ITEMSLOT_Amulet				= 4,
	ITEMSLOT_RingRight			= 5,
	ITEMSLOT_RingLeft			= 6,
	ITEMSLOT_Sheltom			= 7,
	ITEMSLOT_Bracelets			= 8,
	ITEMSLOT_Gauntlets			= 9,
	ITEMSLOT_Boots				= 10,
	ITEMSLOT_PotionOne			= 11,
	ITEMSLOT_PotionTwo			= 12,
	ITEMSLOT_PotionThree		= 13,
	ITEMSLOT_Costume			= 14,
};

enum ESocketType : unsigned char
{
	SOCKETTYPE_None,

	SOCKETTYPE_Prismatic,
	SOCKETTYPE_Emerald,
	SOCKETTYPE_Ruby,
	SOCKETTYPE_Aquamarine,
	SOCKETTYPE_Amethyst,
	SOCKETTYPE_Topaz,

	SOCKETTYPE_Count = 7,
};

enum EGemType : unsigned char
{
	GEMTYPE_None,

	GEMTYPE_Triangular,
	GEMTYPE_Square,
	GEMTYPE_Marquise,
};

enum EGemItem : unsigned char
{
	GEMITEM_None,

	/*Normal Gems*/
	GEMITEM_Emerald,
	GEMITEM_Ruby,
	GEMITEM_Aquamarine,
	GEMITEM_Amethyst,
	GEMITEM_Topaz,

	/*Special Gems*/
	GEMITEM_RainbowOpal,
	GEMITEM_DemonSlayer,
	GEMITEM_BloodyPerl,
	GEMITEM_NavyPerl,
	GEMITEM_TempskronMartyr,
	GEMITEM_MorionMartyr,
	GEMITEM_RoyalDiamond,
	GEMITEM_PolishedCitrine,
	GEMITEM_ElementalTourmaline,
	GEMITEM_DivineHeart,
	GEMITEM_LuckyCirclet,
};

enum EGemSpecial
{
	GEMSPECIAL_None,
	GEMSPECIAL_WPNMaxAtkPowAdd1,				//+1 Max Atk Pow on Weapon
	GEMSPECIAL_WPNMaxAtkPowAdd2,				//+2 Max Atk Pow on Weapon
	GEMSPECIAL_WPNReqDec5PercentStrenght,		//-5% Strenght on Weapon
	GEMSPECIAL_WPNAtkPowAdd1,					//+1 Min & Max Atk Pow on Weapon
	GEMSPECIAL_HPAdd10,							//+10 HP
	GEMSPECIAL_WeightAdd100,					//+100 iWeight
	GEMSPECIAL_AbsorbAdd5,						//+5 fAbsorbRating
	GEMSPECIAL_BlockAdd10Percent,				//+10% Block
	GEMSPECIAL_WPNReqDec5PercentSpirit,			//-5% Spirit
	GEMSPECIAL_HPRegen1,						//1.0 Regen HP
	GEMSPECIAL_FireResistance10,				//+10 Fire saElementalDef
	GEMSPECIAL_MPAdd100,						//+100 MP
	GEMSPECIAL_MPRegen2,						//2.0 Regen MP
	GEMSPECIAL_SPAdd200,						//+200 SP
	GEMSPECIAL_IceResistance10,					//+10 Ice saElementalDef
	GEMSPECIAL_WPNReqDec5PercentTalent,			//-5% Talent
	GEMSPECIAL_AtkRtgAdd20,						//+20 Attack Rating
	GEMSPECIAL_DefenseAdd30,					//+30 Defense
	GEMSPECIAL_WPNRangeAdd10,					//+10 Range on Weapon
	GEMSPECIAL_OrganicResistanceAdd10,			//+10 Organic saElementalDef
	GEMSPECIAL_WPNReqDec5PercentAgility,		//-5% Agility on Weapon
	GEMSPECIAL_AtkRtgAdd30,						//+30 Attack Rating
	GEMSPECIAL_DefenseAdd40,					//+40 Defense
	GEMSPECIAL_RunSpeedAdd1,					//+1 Run fMovementSpeed
	GEMSPECIAL_LightningResistanceAdd10,		//+10 Lightning saElementalDef
	GEMSPECIAL_BlockAdd1Percent,				//+1% Block
	GEMSPECIAL_HPAdd25,							//+25 HP
	GEMSPECIAL_AbsorbAdd8,						//+8 fAbsorbRating
	GEMSPECIAL_AllStatsDec2Percent,				//-2% All Stats
	GEMSPECIAL_HPRegen2,						//2.0 HP Regen
	GEMSPECIAL_DefenseAdd50,					//+50 Defense
	GEMSPECIAL_PoisonResistanceAdd10,			//+10 Poison saElementalDef
};

struct AgingColorStructure
{
	short								sRed;
	short								sGreen;
	short								sBlue;
	short								sAlpha;
	short								iUnk;
	short								sSpeed;
};

static AgingColorStructure saAgingColorTable[MAX_AGING - 3]
{
	{ 100,	 40,	 90,	0,	 -1,	0	},		// 4
	{ 120,	100,	 10,	0,	 -1,	0	},		// 5
	{   0,	110,	 30,	0,	 -1,	0	},		// 6
	{   0,	 50,	140,	0,	 -1,	0	},		// 7
	{ 100,	  0,	 90,	0,	 -1,	0	},		// 8
	{ 150,	 60,	  0,	0,	 -1,	0	},		// 9
	{ 150,	 10,	  0,	0,	 -1,	0	},		// 10
	{  20,	220,	190,	0,	 -1,	0	},		// 11
	{  10,	220,	 30,	0,	 -1,	0	},		// 12
	{ 170,	 40,	170,	0,	 -1,	0	},		// 13
	{ 250,	 30,	160,	0,	 -1,	0	},		// 14
	{  30,	190,	255,	0,	 -1,	0	},		// 15
	{ 250,	130,	 30,	0,	 -1,	0	},		// 16
	{ 120,	 30,	 30,	0,	 -1,	0	},		// 17
	{ 130,	  0,	255,	0,	 -1,	0	},		// 18
	{ 255,	255,	 0,		0,	 -1,	0	},		// 19
	{ 255,	255,	255,	0,	 -1,	0	},		// 20
	{ 1024,	256,	256,	0,	 2,		14	},		// 21
	{ 256,	256,	640,	0,	 2,		14	},		// 22
	{ 1024,	256,	256,	0,	 2,		14	},		// 23
	{ 256,	256,	640,	0,	 2,		14	},		// 24
};

static AgingColorStructure saMixingColorTable[10]
{
	{ 13,	 0,	 5,		0,	  9,	8	},		// 4
	{ 13,	 0,	 6,		0,	  5,	8	},		// 5
	{ 13,	 0,	 7,		0,	  6,	9	},		// 6
	{ 13,	 0,	 8,		0,	  7,	9	},		// 7
	{ 13,	 0,	 9,		0,	  8,	9	},		// 8
	{ 13,	 0,	 10,	0,	  9,	9	},		// 9  
	{ 13,	 0,	 11,	0,	  0,	9	},		// 11 // 
	{ 1,	 0,	 1,		0,	  12,	9 },		// 12 // Enigma
	{ 2,	 0,	 2,		0,	  13,	9 },		// 13 // Bellum
	{ 3,	 0,	 2,		0,	  14,	9 },		// 13 // Oredo

};


struct SocketItem
{
	ESocketType 	eSocketType;
	EGemType		eGemType;
	EGemItem		eGemItem;
};

struct SpecItemData
{
	float									fSpecAbsorbRating;
	int										iSpecDefenseRating;
	float									fSpecMovementSpeed;
	float									fSpecBlockRating;
	int										iSpecAttackSpeed;
	int										iSpecCritical;
	int										iSpecAttackRange;
	float									fSpecMagicMastery;
	short									saSpecElementalDef[8];
	short									saSpecElementalAtkDiv[8];
	int										iSpecAddMPDiv;
	int										iSpecAddHPDiv;
	int										iSpecAttackRatingDiv;
	short									iSpecAttackPowerDivMin;
	short									iSpecAttackPowerDiv;
	float									fSpecMPRegen;
	float									fSpecHPRegen;
	float									fSpecSPRegen;
	int										iSpecEvade;

	short									sSpecPenetration;
	short									sSpecHPPotionEfficience;
	short									sSpecMPPotionEfficience;
	short									sSpecSPPotionEfficience;


	int										iPadding99[29];
};

class ItemID
{
public:
	ItemID() {};
	ItemID( int i ) { *(int *)(this) = i; }

	char									iIDHigh;	//always zero
	char									iIDLow;		//++ counter
	short									sItemType;

	inline unsigned int						ToInt() { return *(unsigned int *)(this); }
	inline EItemID							ToItemID() { return *(EItemID*)(this); }
	inline EItemType						ToItemType() { return (EItemType)(*(unsigned int *)(this) & 0xFFFF0000); }
	inline EItemBase						ToItemBase() { return (EItemBase)(*(unsigned int *)(this) & 0xFF000000); }

	inline void								SetItemID( EItemID iItemID ) { *(EItemID*)this = iItemID; }

	static inline ItemID					* ToItemID( EItemID * i ) { return (ItemID *)i; }
};

struct Item
{
	//Attributes
	DWORD									dwSize;
	ITEMCHECKSUM							iChk1;
	DWORD									dwVersion;
	DWORD									dwTime;
	ITEMCHECKSUM							iChk2;

	//Statistics
	CurMax									sIntegrity;
	ItemID									sItemID;
	char									szItemName[32];
	int										iWeight;
	int										iSalePrice;
	int										iIndex;
	int										iPotionCount;
	short									saElementalDef[8];
	int										iSight;
	int										iUnknown02;
	MinMax									sDamage;
	int										iAttackRange;
	int										iAttackSpeed;
	int										iAttackRating;
	int										iCritical;
	float									fAbsorbRating;
	int										iDefenseRating;
	float									fBlockRating;
	float									fMovementSpeed;
	int										iPotionStorage;
	float									fMagicMastery;
	float									fMPRegen;
	float									fHPRegen;
	float									fSPRegen;
	float									fAddHP;
	float									fAddMP;
	float									fAddSP;
	int										iLevel;
	int										iStrength;
	int										iSpirit;
	int										iTalent;
	int										iAgility;
	int										iHealth;
	MinMax									sMPRecovery;
	MinMax									sHPRecovery;
	MinMax									sSPRecovery;
	int										iGold;
		
	BOOL									bCanNotUse;

	DWORD									iBackupKey;
	DWORD									iBackupChk;

	short									iScaleBlink[2];
	int										iItemUniqueID;
	short									sEffectBlink[2];
	short									sEffectColor[4];
	BOOL									bEnableEffect;

	int										eSpecialization;
	SpecItemData							sSpecData;

	EItemCraftType							eCraftType;
	int										eMixEffect;
	union
	{
		USHORT								sAgeLevel;
		USHORT								sMixID;
	};
	USHORT									bMaturing;
	UCurMax									sMatureBar;
	
	int										iUnknown;

	short									sSpecialItemType[2];

	DWORD									tTime;
	SocketItem								sSocketData[2];

	BYTE									bCostumeItem;
	BYTE									bEvade;
	BYTE									bLockedItemType;
	char									cPadding[11];

	CurMax									sQuestMonsters;

	EMixTypeName							eMixTypeName;
	BOOL									bPerfectItem;

	int										iPadding666;
};

class ItemData
{
public:
	ItemID									sBaseItemID;
	char									szBaseName[32];
	char									szInventoryName[16];
	int										iWidth;
	int										iHeight;
	char									szCategory[64];
	EItemSlotFlag							iItemSlotFlag;
	char									szModelName[64];
	EItemSlotFlag							iVisibleItemType;
	EItemInvSound							iInvItemSound;
	int										iItemWpnDmg;
	BOOL									bValid;
	Point2D									sPosition;
	Point2D									sPlacePosition;
	void									* pcInventoryTexture;
	int										iItemSlot;
	int										iPotionCount;
	int										iNotUse;
	int										iSalePrice;
	Point2D									sOldPosition;
	void									* pcTempInventoryTexture;
	Item								sItem;

	BOOL									IsOneHandedWeapon();
	BOOL									IsTwoHandedWeapon();
};

struct DefinitionItem
{
	struct Item								sItem; // 0x0
	short									IntegrityMin; // 0x214
	short									IntegrityMax; // 0x216
	short									OrganicMin; // 0x218
	short									OrganicMax; // 0x21A
	short									UnknownResistanseMin; // 0x21C
	short									UnknownResistanseMax; // 0x21E
	short									FireMin; // 0x220
	short									FireMax; // 0x222
	short									FrostMin; // 0x224
	short									FrostMax; // 0x226
	short									LightningMin; // 0x228
	short									LightningMax; // 0x22A
	short									PoisonMin; // 0x22C
	short									PoisonMax; // 0x22E
	short									sUnknownResistance[4]; // 0x230
	short									AttackPower1Min; // 0x238
	short									AttackPower2Min; // 0x23A
	short									AttackPower1Max; // 0x23C
	short									AttackPower2Max; // 0x23E
	short									AttackRatingMin; // 0x240
	short									AttackRatingMax; // 0x242
	short									DefenseMin; // 0x244
	short									DefenseMax; // 0x246
	float									BlockRatingMin; // 0x248
	float									BlockRatingMax; // 0x24C
	float									AbsorbMin; // 0x250
	float									AbsorbMax; // 0x254
	float									RunSpeedMin; // 0x258
	float									RunSpeedMax; // 0x25C
	int										AddHPMin; // 0x260
	int										AddHPMax; // 0x264
	int										AddMPMin; // 0x268
	int										AddMPMax; // 0x26C
	int										AddSTMMin; // 0x270
	int										AddSTMMax; // 0x274
	float									MPRegenMin; // 0x278
	float									MPRegenMax; // 0x27C
	float									HPRegenMin; // 0x280
	float									HPRegenMax; // 0x284
	float									STMRegenMin; // 0x288
	float									STMRegenMax; // 0x28C
	short									AddSpecDefenseMin; // 0x290
	short									AddSpecDefenseMax; // 0x292
	float									AddSpecAbsorbMin; // 0x294
	float									AddSpecAbsorbMax; // 0x298
	float									AddSpecRunSpeedMin; // 0x29C
	float									AddSpecRunSpeedMax; // 0x2A0
	float									SpecialMagicMastery[0x2]; // 0x2A4
	float									AddSpecMPRegenMin; // 0x2AC
	float									AddSpecMPRegenMax; // 0x2B0
	int										SpecAttackRatingLevelMin; // 0x2B4
	int										SpecAttackRatingLevelMax; // 0x2B8
	DWORD									JobBitCodeRandom[0xC]; // 0x2BC
	int										JobBitCodeRandomCount; // 0x2EC
	short									sGenDay[0x2]; // 0x2F0
	unsigned char *							DefCompressData[0x214]; // 0x2F4
	int										DefCompressDataLen; // 0xB44
};

struct DefinitionItemEx
{
	EItemID									eItemID;

	MinMax									sSpecPenetration;
	MinMax									sSpecHPPotionEfficience;
	MinMax									sSpecMPPotionEfficience;
	MinMax									sSpecSPPotionEfficience;
};

struct DropSettingsData
{
	int					iItemID;	//0x00
	int					iPercent;	//0x04
	short				sGoldMin;	//0x08
	short				sGoldMax;	//0x0A
};

struct DropItemData
{
	int										iItemID;
	int										iChk1;
	DWORD									iChk2;
};

struct ItemBoxItem
{
	BOOL									bValid;

	int										iID;

	char									szSenderName[32];

	BOOL									bItem;
	SYSTEMTIME								sDate;

	int										iItemID;
	int										iSpecialization;

	Item									sItem;
};

struct ItemBoxSlot
{
	int										iNumItems;
	ItemBoxItem								saItemBox[MAX_ITEMSINITEMBOX];
};

struct RecordItem
{
	int			iItemCount;

	Point2D		sItemPosition;
	int			iItemPosition;

	Item	sItem;
};

struct InventoryItemData
{
	int				iPosition;
	Rectangle2D		sBox;
	int				iItemIndex;
	int				iWeaponClass;
};

struct SellItemShopData
{
	EItemID				eItemID;
	DWORD				dwHead;
	DWORD				dwChecksum;
	int					iPrice;
};

struct ItemLoadData
{
	BOOL				bState;
	DWORD				dwSerial;
	Item				sItem;
};

struct RespecStone
{
	EItemID				eItemID;
	int					iMinLevel;
	int					iMaxLevel;
	int					iRequiredStones;
	int					iPrice;
};

struct PriceItem
{
	int					iRealPrice;
	int					iPrice;
	int					iRepairPrice;
};


struct SocketItemData
{
	BOOL					bOpenNPC;
	ItemData				sItemData;
	ItemData				sRune[5];
	ItemData				sStone;
	int						iSocketWorkType;
	char					cPadding[32];
	int						iItemCounter;
};

struct ItemLogBox
{
	int										iSize;
	int										iID;
	struct SPlayer
	{
		char								szAccountName[32];
		char								szCharacterName[32];
		IN_ADDR								iIP;
	};

	struct SItem
	{
		int									iItemID;
		int									iAmount;
		int									iChecksum1;
		int									iChecksum2;
	};

	int										iActionCode;

	SPlayer									sPlayer;
	SItem									sItem;
};

struct CompressedItem
{
	ItemID									sItemID;
	char									szBaseName[32];
	char									szInventoryName[16];
	int										iWidth;
	int										iHeight;
	char									szDropFolder[16];
	UINT									iClass;
	char									szDropName[16];
	UINT									iModelPosition;
	UINT									iSound;
	UINT									iWeaponClass;
};

struct DropItemView
{
	BOOL									bFormatted;
	BOOL									bVisible;
	BOOL									bActive;

	Point3D									sPosition;

	char									szModelName[64];
	char									szName[64];

	int										iClass;

	class PTModel							* pcModel;
	struct EXEModelData						* psModelData;

	BOOL									bHidden;

	int										iItemID;

	DWORD									dwLastUpdate;

	int										iServerID;

	Point3D									sRenderPosition;
	Point3D									sSelfPosition;
	Point3D									sAngle;
};

struct ItemInventoryData
{
	int										iItemSlot;
	Rectangle2D								sBox;
	int										iItemIndex;
	int										iWeaponClass;
};

#define ITEM_PERSONALSHOP_MAX	32
#define ITEM_PERSONALSHOP_QUEUE 8

struct PacketPersonalBotShopData : Packet
{
	char									szMessage[256];
	ItemData								cItemData[ITEM_PERSONALSHOP_MAX];
	int										iPrice[ITEM_PERSONALSHOP_MAX];
	int										iaItems[3];
};

struct PricePersonalShopData
{
	ItemID				sItemID;
	int					iChk1;
	int					iChk2;

	int					iPrice;
	bool				bCanBuy;
	bool				bCredits;
	
	int					iCount;
};

struct PacketPersonalShopItemList : Packet
{
	int						iSenderID;
	int						iRequesterID;

	int						iItemCount;
	ItemData				caItemData[ITEM_PERSONALSHOP_QUEUE];
	PricePersonalShopData	saItemPrice[ITEM_PERSONALSHOP_QUEUE];

	short					sPacketNumber;
	short					sPacketMax;

	BOOL					IsFirst() { return sPacketNumber == 1 ? TRUE : FALSE; }
	BOOL					IsOnly() { return sPacketNumber == sPacketMax ? TRUE : FALSE; }
};

struct PacketPersonalShopTradeItems : Packet
{
	int						iSellerID;
	int						iBuyerID;

	bool					bBuy;

	PricePersonalShopData	sItemPrice;

	ItemData				cItemData;

	int						iItemCount;
};

struct PacketPersonalShopRequestView : Packet
{
	PacketPersonalShopRequestView( int _iSenderID, int _iRequesterID ) { iSenderID = _iSenderID; iRequesterID = _iRequesterID; };
	~PacketPersonalShopRequestView() {};
	int						iSenderID;
	int						iRequesterID;
};

enum ESlotTypeHandle
{
	ITEMSLOTHANDLE_Get,
	ITEMSLOTHANDLE_Put,
};
enum ESlotTypeHandleWhere
{
	ITEMSLOTHANDLEWHERE_Perfectize,
	ITEMSLOTHANDLEWHERE_Swap,
};

struct PacketSlotItemHandle : Packet
{

	ESlotTypeHandle			iTypeHandle;
	ESlotTypeHandleWhere	iTypeWhere;

	int					iItemID;

	int					iChk1;
	int					iChk2;
};

struct NPCItemBoxMessageBox
{
	BOOL				bActive;
	ItemData			cItemData;
	char				szMessage[128];
	char				szItemName[64];

	BOOL				bYesButtonHover;
	BOOL				bNoButtonHover;

	DWORD				dwReserved[4];
};

struct PacketNPCItemBox : Packet
{
	char					szSenderName[32];
	SYSTEMTIME				sDate;

	union
	{
		struct
		{
			LARGE_INTEGER	liEXP;
		} EXP;

		struct
		{
			int				iValue;
			int				iReserved;
		} Gold;
	};

	short					sWeight;

	BOOL					bItem;
	BOOL					bAccepted;

	ItemData				cItemData;
};

#define MAX_ITEMBOX_SEND			25
#define MAX_ITEMBOX_SEND_QUEUE		8

struct PacketNPCItemBoxSend : Packet
{
	char					szCharacterName[32];

	int						iCount;
	ItemData				cItemData[MAX_ITEMBOX_SEND_QUEUE];
};

struct PacketNPCItemBoxSendResponse : Packet
{
	int						iResult;

	int						iCount;

	int						iaItemID[MAX_ITEMBOX_SEND_QUEUE];
	int						iaChk1[MAX_ITEMBOX_SEND_QUEUE];
	int						iaChk2[MAX_ITEMBOX_SEND_QUEUE];
};

struct PacketMixServer : Packet
{
	int										iDocIndex;
	int										iResult;
	ItemData								sItemData;
	DWORD									dwCode[12];
	DWORD									dwHead[12];
	DWORD									dwCheckSum[12];
	int										iIndex;
	int										iGold;

	DWORD									dwStoneItemCode;
	DWORD									dwStoneHead;
	DWORD									dwStoneCheckSum;
};

struct PacketItemData : Packet
{
	int										iItemIndex;
	ItemData								sItem;
};

struct PacketUseUnionCore : Packet
{
	Item								sItem;
	Point3D									sPosition;
};

struct PacketThrowItem : Packet
{
	Item								sItem;
	Point3D									sPosition;
	DWORD									dwSecCode[4];
};

struct PacketResetItem : Packet
{
	int										iDocIndex;
	int										iResult;
	int										iIndex;

	ItemData								sItemData;

	DWORD									dwCode;
	DWORD									dwHead;
	DWORD									dwCheckSum;
};

struct PacketQuestNPCItemList : Packet
{
	int										iID;

	int										iIndex;

	class ItemData							cItemData;

	BOOL									bLast;
};

#define MAX_QUESTDYNAMICMENU			30

struct PacketDynamicQuestOpen : Packet
{
	char									szImagePath[260];

	char									szMainText[4096];

	int										iQuestCount;

	struct QuestData
	{
		int									iQuestID;
		char								szQuestName[64];
		IMinMax								sRequiredLevel;

		bool								bDone;
	};

	QuestData								saQuestData[MAX_QUESTDYNAMICMENU];
};

struct PacketFuryArenaItemData : Packet
{
	ItemData								sItemData;
};

struct PacketSocketSystem : Packet
{
	ItemData								sItemData;
	ItemData								sRune[5];
	ItemData								sItemStone;
	int										iSocketWorkType; //0x0E = Drill, 0x0F = Stone
}; //sSize = 0x1598

struct PacketItemPerfectView : Packet
{
	ItemData								cItemData;
};

struct PacketItem : Packet
{
	struct Item							sItem;
	int										iX;
	int										iY;
	int										iZ;
	DWORD									dwSecCode[4];
};

struct PacketManufactureItem : Packet
{
	int								iUunknown;
	int								iResult;
	ItemData						sItemData;
	EItemID							iRecipeID;
	EItemID							iaRuneID[3];
	int								iRecipeChk1;
	int								iaChk1[3];
	int								iRecipeChk2;
	int								iaChk2[3];
	int								iIndex;
	int								iGold;

	DWORD							iExStoneItemCode;
	DWORD							iExStoneHead;
	DWORD							iExStoneCheckSum;
};

struct PacketAgingItem : Packet
{
	int						DocIndex;
	int						Result;
	ItemData				sItem;
	DWORD					SheltomCode[12];
	DWORD					Head[12];
	DWORD					CheckSum[12];
	int						Index;
	int						Money;

	DWORD					StoneItemCode;
	DWORD					StoneHead;
	DWORD					StoneCheckSum;
};

